#include "led.h"

// 控制LED2亮灭
void led_config(void)
{
    //*************************[1.使能时钟]*************************
    rcu_periph_clock_enable(LED4_RCU);
    //===================================================

    //*************************[2.配置GPIO模式（输入/输出 上拉/下拉）]*************************
		gpio_mode_set(LED4_GPIO, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, LED4_PIN);
    //===================================================

    //*************************[3.输出模式 输出速度]*************************
		gpio_output_options_set(LED4_GPIO, GPIO_OTYPE_PP, GPIO_OSPEED_2MHZ, LED4_PIN);
    //===================================================

    
}