#ifndef __LED_H__
#define __LED_H__
#include "gd32f4xx.h"
#include "systick.h"

//*************************[1.配置时钟（AHB1时钟）]*************************
//AHB1总线基地址
#define AHB1_BASE 0x40020000

//时钟基地址
#define RCU_BASE (AHB1_BASE+0x3800)

//AHB1使能寄存器
#define RCU_GPIOD *(unsigned int *)(RCU_BASE+0X30)
//===================================================

//*************************[2.配置工作模式]*************************
//PD7端口控制寄存器（功能：输入00 输出01 备用10 模拟11）
//定义GPIOD的基地址
#define GPIOD_BASE 0x40020C00

//定义PD7端口控制寄存器地址=(GPIO基地址+控制寄存器偏移地址)
#define GPIOD_CTL *(unsigned int *)(GPIOD_BASE+0x00)
//===================================================

//*************************[3.上拉和下拉]*************************
//上拉和下拉地址=GPIO的基地址+上拉和下拉的偏移地址
#define GPIOD_PUD *(unsigned int *)(GPIOD_BASE+0x0C)
//===================================================

//*************************[4.输出模式配置（推挽1 开漏0）]*************************
#define GPIOD_OMODE *(unsigned int *)(GPIOD_BASE+0x04)
//===================================================

//*************************[5.输出速度控制]*************************
#define GPIOD_OSPD *(unsigned int *)(GPIOD_BASE+0x08)
//===================================================

//*************************[6.控制输出高低电平]*************************
//0为引脚输出低电平，1为引脚输出高电平
#define GPIOD_OCTL *(unsigned int *)(GPIOD_BASE+0x14)
//===================================================

void led_control(void);
#endif